; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?x ?y)
		(car ?c)
		(location ?l)
		(at-ferry ?l)
		(at ?c ?l)
		(empty-ferry)
		(on ?c))

   (:action sail
       :parameters  (?from ?to)
       :precondition (and (not-eq ?from ?to) 
                          (location ?from) (location ?to) (at-ferry ?from))
       :effect (and  (at-ferry ?to)
		     (not (at-ferry ?from))))


   (:action board
       :parameters (?car ?loc)
       :precondition  (and  (car ?car) (location ?loc)
			    (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters  (?car  ?loc)
       :precondition  (and  (car ?car) (location ?loc)
			    (on ?car) (at-ferry ?loc))
       :effect (and (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-l13-c7)
(:domain ferry)
(:objects l0 l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 
          c0 c1 c2 c3 c4 c5 c6 
)
(:init
(location l0)
(location l1)
(location l2)
(location l3)
(location l4)
(location l5)
(location l6)
(location l7)
(location l8)
(location l9)
(location l10)
(location l11)
(location l12)
(car c0)
(car c1)
(car c2)
(car c3)
(car c4)
(car c5)
(car c6)
(not-eq l0 l1)
(not-eq l1 l0)
(not-eq l0 l2)
(not-eq l2 l0)
(not-eq l0 l3)
(not-eq l3 l0)
(not-eq l0 l4)
(not-eq l4 l0)
(not-eq l0 l5)
(not-eq l5 l0)
(not-eq l0 l6)
(not-eq l6 l0)
(not-eq l0 l7)
(not-eq l7 l0)
(not-eq l0 l8)
(not-eq l8 l0)
(not-eq l0 l9)
(not-eq l9 l0)
(not-eq l0 l10)
(not-eq l10 l0)
(not-eq l0 l11)
(not-eq l11 l0)
(not-eq l0 l12)
(not-eq l12 l0)
(not-eq l1 l2)
(not-eq l2 l1)
(not-eq l1 l3)
(not-eq l3 l1)
(not-eq l1 l4)
(not-eq l4 l1)
(not-eq l1 l5)
(not-eq l5 l1)
(not-eq l1 l6)
(not-eq l6 l1)
(not-eq l1 l7)
(not-eq l7 l1)
(not-eq l1 l8)
(not-eq l8 l1)
(not-eq l1 l9)
(not-eq l9 l1)
(not-eq l1 l10)
(not-eq l10 l1)
(not-eq l1 l11)
(not-eq l11 l1)
(not-eq l1 l12)
(not-eq l12 l1)
(not-eq l2 l3)
(not-eq l3 l2)
(not-eq l2 l4)
(not-eq l4 l2)
(not-eq l2 l5)
(not-eq l5 l2)
(not-eq l2 l6)
(not-eq l6 l2)
(not-eq l2 l7)
(not-eq l7 l2)
(not-eq l2 l8)
(not-eq l8 l2)
(not-eq l2 l9)
(not-eq l9 l2)
(not-eq l2 l10)
(not-eq l10 l2)
(not-eq l2 l11)
(not-eq l11 l2)
(not-eq l2 l12)
(not-eq l12 l2)
(not-eq l3 l4)
(not-eq l4 l3)
(not-eq l3 l5)
(not-eq l5 l3)
(not-eq l3 l6)
(not-eq l6 l3)
(not-eq l3 l7)
(not-eq l7 l3)
(not-eq l3 l8)
(not-eq l8 l3)
(not-eq l3 l9)
(not-eq l9 l3)
(not-eq l3 l10)
(not-eq l10 l3)
(not-eq l3 l11)
(not-eq l11 l3)
(not-eq l3 l12)
(not-eq l12 l3)
(not-eq l4 l5)
(not-eq l5 l4)
(not-eq l4 l6)
(not-eq l6 l4)
(not-eq l4 l7)
(not-eq l7 l4)
(not-eq l4 l8)
(not-eq l8 l4)
(not-eq l4 l9)
(not-eq l9 l4)
(not-eq l4 l10)
(not-eq l10 l4)
(not-eq l4 l11)
(not-eq l11 l4)
(not-eq l4 l12)
(not-eq l12 l4)
(not-eq l5 l6)
(not-eq l6 l5)
(not-eq l5 l7)
(not-eq l7 l5)
(not-eq l5 l8)
(not-eq l8 l5)
(not-eq l5 l9)
(not-eq l9 l5)
(not-eq l5 l10)
(not-eq l10 l5)
(not-eq l5 l11)
(not-eq l11 l5)
(not-eq l5 l12)
(not-eq l12 l5)
(not-eq l6 l7)
(not-eq l7 l6)
(not-eq l6 l8)
(not-eq l8 l6)
(not-eq l6 l9)
(not-eq l9 l6)
(not-eq l6 l10)
(not-eq l10 l6)
(not-eq l6 l11)
(not-eq l11 l6)
(not-eq l6 l12)
(not-eq l12 l6)
(not-eq l7 l8)
(not-eq l8 l7)
(not-eq l7 l9)
(not-eq l9 l7)
(not-eq l7 l10)
(not-eq l10 l7)
(not-eq l7 l11)
(not-eq l11 l7)
(not-eq l7 l12)
(not-eq l12 l7)
(not-eq l8 l9)
(not-eq l9 l8)
(not-eq l8 l10)
(not-eq l10 l8)
(not-eq l8 l11)
(not-eq l11 l8)
(not-eq l8 l12)
(not-eq l12 l8)
(not-eq l9 l10)
(not-eq l10 l9)
(not-eq l9 l11)
(not-eq l11 l9)
(not-eq l9 l12)
(not-eq l12 l9)
(not-eq l10 l11)
(not-eq l11 l10)
(not-eq l10 l12)
(not-eq l12 l10)
(not-eq l11 l12)
(not-eq l12 l11)
(empty-ferry)
(at c0 l3)
(at c1 l9)
(at c2 l9)
(at c3 l3)
(at c4 l0)
(at c5 l9)
(at c6 l1)
(at-ferry l5)
)
(:goal
(and
(at c0 l11)
(at c1 l3)
(at c2 l3)
(at c3 l10)
(at c4 l1)
(at c5 l7)
(at c6 l10)
)
)
)

; plan
1. (sail l5 l9)
   deleted: (at-ferry l5)
   added: (at-ferry l9)
   goals met: 0 of 7
2. (board c5 l9)
   deleted: (at c5 l9) (empty-ferry)
   added: (on c5)
   goals met: 0 of 7
3. (sail l9 l7)
   deleted: (at-ferry l9)
   added: (at-ferry l7)
   goals met: 0 of 7
4. (debark c5 l7)
   deleted: (on c5)
   added: (at c5 l7) (empty-ferry)
   goals met: 1 of 7
5. (sail l7 l9)
   deleted: (at-ferry l7)
   added: (at-ferry l9)
   goals met: 1 of 7
6. (board c2 l9)
   deleted: (at c2 l9) (empty-ferry)
   added: (on c2)
   goals met: 1 of 7
7. (sail l9 l3)
   deleted: (at-ferry l9)
   added: (at-ferry l3)
   goals met: 1 of 7
8. (debark c2 l3)
   deleted: (on c2)
   added: (at c2 l3) (empty-ferry)
   goals met: 2 of 7
9. (board c3 l3)
   deleted: (at c3 l3) (empty-ferry)
   added: (on c3)
   goals met: 2 of 7
10. (sail l3 l10)
   deleted: (at-ferry l3)
   added: (at-ferry l10)
   goals met: 2 of 7
11. (debark c3 l10)
   deleted: (on c3)
   added: (at c3 l10) (empty-ferry)
   goals met: 3 of 7
12. (sail l10 l9)
   deleted: (at-ferry l10)
   added: (at-ferry l9)
   goals met: 3 of 7
13. (board c1 l9)
   deleted: (at c1 l9) (empty-ferry)
   added: (on c1)
   goals met: 3 of 7
14. (sail l9 l3)
   deleted: (at-ferry l9)
   added: (at-ferry l3)
   goals met: 3 of 7
15. (debark c1 l3)
   deleted: (on c1)
   added: (at c1 l3) (empty-ferry)
   goals met: 4 of 7
16. (board c0 l3)
   deleted: (at c0 l3) (empty-ferry)
   added: (on c0)
   goals met: 4 of 7
17. (sail l3 l11)
   deleted: (at-ferry l3)
   added: (at-ferry l11)
   goals met: 4 of 7
18. (debark c0 l11)
   deleted: (on c0)
   added: (at c0 l11) (empty-ferry)
   goals met: 5 of 7
19. (sail l11 l10)
   deleted: (at-ferry l11)
   added: (at-ferry l10)
   goals met: 5 of 7
20. (sail l10 l1)
   deleted: (at-ferry l10)
   added: (at-ferry l1)
   goals met: 5 of 7
21. (board c6 l1)
   deleted: (at c6 l1) (empty-ferry)
   added: (on c6)
   goals met: 5 of 7
22. (sail l1 l10)
   deleted: (at-ferry l1)
   added: (at-ferry l10)
   goals met: 5 of 7
23. (debark c6 l10)
   deleted: (on c6)
   added: (at c6 l10) (empty-ferry)
   goals met: 6 of 7
24. (sail l10 l1)
   deleted: (at-ferry l10)
   added: (at-ferry l1)
   goals met: 6 of 7
25. (sail l1 l0)
   deleted: (at-ferry l1)
   added: (at-ferry l0)
   goals met: 6 of 7
26. (board c4 l0)
   deleted: (at c4 l0) (empty-ferry)
   added: (on c4)
   goals met: 6 of 7
27. (sail l0 l1)
   deleted: (at-ferry l0)
   added: (at-ferry l1)
   goals met: 6 of 7
28. (debark c4 l1)
   deleted: (on c4)
   added: (at c4 l1) (empty-ferry)
   goals met: 7 of 7
